import { Injectable } from '@angular/core';
import { Storage, SqlStorage } from 'ionic-angular';
// import { Http } from '@angular/http';
// import 'rxjs/add/operator/map';

/*
  Generated class for the DbService provider.

  See https://angular.io/docs/ts/latest/guide/dependency-injection.html
  for more info on providers and Angular 2 DI.
*/
@Injectable()
export class DbService {
  storage: any;

  constructor() {
    this.storage = new Storage(SqlStorage);
    // this.storage.query('CREATE TABLE IF NOT EXISTS list (id INTEGER PRIMARY KEY AUTOINCREMENT, duaName TEXT)');
    //  this.storage.query('CREATE TABLE IF NOT EXISTS dua (id INTEGER PRIMARY KEY AUTOINCREMENT, duaId INTEGER, ayatNumber INTEGER, arab TEXT, rus TEXT, transcription TEXT)');
    //  this.initDb();
    let dbObject = {
      list: [
        {
          'id': 1,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 2,
          'name': 'Алиф лам мим',
          'audio': '02-alif-lam-mim.mp3',
          'ayats': [
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'ألم ',
              'translit': 'Алиф лааам мииим',
              'rus': 'Алиф лам мим,'
            }
          ]
        },
        {
          'id': 3,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 4,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 5,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 6,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 7,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 8,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 9,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 9,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 1,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 10,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 11,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 12,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 13,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 14,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 15,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 16,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 17,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 18,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 19,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        },
        {
          'id': 20,
          'name': 'Фатиха',
          'audio': '01-fatiha.mp3',
          'ayats': [
            {
              'arab': 'أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيمِ',
              'translit': 'А’уузу биЛляаhи минаш- Шайтъаанир-раджиим',
              'rus': 'Прибегаю к Аллаху за помощью против Шайтана, побиваемого камнями.'
            },
            {
              'arab': 'بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ',
              'translit': 'БисмиЛ-ляаhир-рахмаанир-рахиим',
              'rus': 'Во имя Аллаха Милостивого, Милосердного,'
            },
            {
              'arab': 'الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ ',
              'translit': 'Альхамду ли Лляаhи Раббиль-’аалямиин',
              'rus': 'Слава Аллаху,Владыке всех миров,'
            },
            {
              'arab': 'الرَّحْمَـنِ الرَّحِيمِ ',
              'translit': 'Ар-рахмаани-р-рахиим',
              'rus': 'Милостивому, Милосердному,'
            },
            {
              'arab': 'مَالِكِ يَوْمِ الدِّينِ ',
              'translit': 'Маалики яумид-диин',
              'rus': 'Властелину Судного Дня,'
            },
            {
              'arab': 'إِيَّاكَ نَعْبُدُ وإِيَّاكَ نَسْتَعِينُ ',
              'translit': 'Ийяакя на’буду уа ийяакя наста’иин',
              'rus': 'Тебе одному поклоняемся и к Тебе одному взываем о помощи,'
            },
            {
              'arab': 'اهْدِنَــــا الصِّرَاطَ المُستَقِيمَ ',
              'translit': 'Иhдинасъ сырааталь мустакъим',
              'rus': 'Наставь нас на путь праведный,'
            },
            {
              'arab': 'صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ المَغْضُوبِ عَلَيْهِمْ وَلَ الضَّالِّينَ ',
              'translit': 'Сыраатъаль лязиина ан ’амта аляйhим Гъайриль магъдъууби’аляйhим уа лядъ-дъаааллиин',
              'rus': 'Путь тех, кого ты одарил своими благами, Не тех, которые находятся под гневом, и не заблудших.'
            },
            {
              'arab': '(آمين)',
              'translit': '(Аамиин).',
              'rus': '(Аамиин).'
            }
          ]

        }
      ]
    };

    
    this.storage.set('obj', JSON.stringify(dbObject));

  }

  initDb() {
    console.log('INSERTING data...');
    //  let sql = 'INSERT INTO list (id, duaName) VALUES (1,Фатиха)';
    //   return this.storage.query(sql);
  }



  getList() {
    //   let sql = 'SELECT * FROM list';
    //   return this.storage.query(sql);
    return this.storage.get('obj');
  }

  getDuaById(id) {
    //   let sql = 'SELECT * FROM articles WHERE id = \"' + id + '\"';
    //   return this.storage.query(sql);
  }


}

